In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
df = pd.read_csv('apply_demo.csv')

In [4]:
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [5]:
df.size

7978

In [6]:
s1 = Series(['a'] * 7978)

In [7]:
df['A'] = s1

In [8]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  a

In [9]:
df['A'] = df['A'].apply(str.upper)

In [11]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  A

In [17]:
l1 = df['data'][0].strip().split(' ')

In [19]:
l1[1], l1[3], l1[5]

('APPL', '0', '1623')

In [20]:
def foo(line):
    items = line.strip().split(' ')
    return Series([items[1], items[3], items[5]])

In [21]:
df_tmp = df['data'].apply(foo)

In [22]:
df_tmp.head()

      0  1     2
0  APPL  0  1623
1  APPL  0  1623
2  APPL  0  1623
3  APPL  0  1623
4  APPL  1  1649

In [31]:
df_tmp = df_tmp.rename(columns={0: "Symbol", 1: "Seqno", 2: "Price"})

In [54]:
df_tmp.head()

  Symbol Seqno Price
0   APPL     0  1623
1   APPL     0  1623
2   APPL     0  1623
3   APPL     0  1623
4   APPL     1  1649

In [62]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  A

In [63]:
df_new = df.combine_first(df_tmp)

In [64]:
df_new.head()

   A   Price  Seqno Symbol                                data        time
0  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
1  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
2  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
3  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
4  A  1649.0    1.0   APPL   Symbol: APPL Seqno: 1 Price: 1649  1473411963

In [65]:
del df_new['data']
del df_new['A']

In [66]:
df_new.head()

    Price  Seqno Symbol        time
0  1623.0    0.0   APPL  1473411962
1  1623.0    0.0   APPL  1473411962
2  1623.0    0.0   APPL  1473411963
3  1623.0    0.0   APPL  1473411963
4  1649.0    1.0   APPL  1473411963

In [67]:
df_new.to_csv('demo_duplicate1.csv')

In [68]:
ls

 驱动器 E 中的卷是 资料
 卷的序列号是 9680-46FC

 E:\DeepLearning\jupyter_code\jupyter notebook\python数据分析实战 的目录

2018/09/22  15:53    <DIR>          .
2018/09/22  15:53    <DIR>          ..
2018/09/22  15:12    <DIR>          .ipynb_checkpoints
2018/09/21  15:28             2,331 01.Anaconda与Jupyter notebook介绍.ipynb
2018/09/21  15:38             1,396 02.矩阵运算.ipynb
2018/09/21  15:48             8,408 03.Array的创建及访问.ipynb
2018/09/21  15:58            13,397 04.数组与矩阵运算.ipynb
2018/09/21  16:08             7,413 05.Array中的input和output.ipynb
2018/09/21  16:17             7,713 06.Series.ipynb
2018/09/21  16:42            44,744 07.DataFrame.ipynb
2018/09/21  20:07            16,471 08.深入理解Series和DataFrame.ipynb
2018/09/21  20:36            23,316 09.Pandas-DataFrame-IO操作.ipynb
2018/09/21  21:13           173,642 10.DataFrame的selecting and Indexing.ipynb
2018/09/21  21:33            25,390 11.Series和DataFrame的Reindexing.ipynb
2018/09/21  22:16            23,089 12.谈一谈缺失值NaN.ipynb
2018/09/21  22:35            14,316 13.多级Index.ipynb
2018/09/21  22:48             8,425 14.Mapping和Replace.ipynb
2018/09/21  23:01            10,762 15.Series和DataFrame的简单数学运算.ipynb
2018/09/21  23:09            22,832 16.Series和DataFrame的排序功能.ipynb
2018/09/21  23:31            19,029 17.重命名DataFrame的index.ipynb
2018/09/21  23:41            12,863 18.DataFrame的merge操作.ipynb
2018/09/21  23:56            19,257 19.Concatenate和Combine.ipynb
2018/09/22  15:52            27,213 20.通过apply进行数据处理.ipynb
2018/08/22  12:08            42,706 AMZN.csv
2018/08/22  12:08           195,031 apply_demo.csv
2018/08/22  12:08            38,415 BABA.csv
2018/08/22  12:08               423 city_weather.csv
2018/08/22  12:08           134,102 demo_duplicate.csv
2018/09/22  15:53            78,761 demo_duplicate1.csv
2018/09/21  20:34               509 df1.csv
2018/09/21  20:34             2,057 df1.html
2018/09/21  20:36             6,007 df1.xlsx
2018/09/21  23:17           207,774 imdb.csv
2018/08/22  12:08             4,600 iris.csv
2017/09/06  00:17         1,494,688 movie_metadata.csv
2018/09/21  16:06               120 one_array.npy
2018/08/22  12:08            44,028 Pokemon.csv
2018/08/22  12:08             9,520 sales-funnel.xlsx
2018/08/22  12:08            52,089 top5.csv
2018/08/22  12:08            61,194 train.csv
2018/09/21  16:08               474 two_array.npz
2018/08/22  12:08        10,578,201 usa_flights.csv
2018/09/21  16:05               195 x.pkl
              40 个文件     13,432,901 字节
               3 个目录 95,580,590,080 可用字节